app/controllers/articles_controller.rb

  def create
    article = Article.new
    article.title = params[:title]
    article.description = params[:description]
    article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-02-25 23:00:54.727585"], ["updated_at", "2021-02-25 23:00:54.727585"]]

  def update
    # raise params.inspect
    a = Article.find params[:id]
    a.update params.require(:article).permit(:title, :description)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-02-25 23:38:05.777980"], ["id", 1]]